app/controllers/registers_controller.rb

SELECT "registers".* FROM "registers"
---
  def index
    @registers = Register.all

INSERT INTO "registers" ("name", "number", "city", "cpf", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "aa"], ["number", 222], ["city", "a"], ["cpf", "23"], ["created_at", "2023-11-28 01:03:09.125574"], ["updated_at", "2023-11-28 01:03:09.125574"]]
---
  def create
    @register = Register.new(register_params)

    respond_to do |format|
      if @register.save

UPDATE "registers" SET "city" = ?, "updated_at" = ? WHERE "registers"."id" = ?  [["city", "Chapecó"], ["updated_at", "2023-11-28 01:08:35.103010"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @register.update(register_params)

DELETE FROM "registers" WHERE "registers"."id" = ?  [["id", 1]]
---
  def destroy
    @register.destroy

SELECT  "registers".* FROM "registers" WHERE "registers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_register
      @register = Register.find(params[:id])